{
  "intents": [
    {
      "tag": "gptQuery",
      "patterns": ["[INSERT PATTERN]"],
      "responses": ["[INSERT RESPONSE]"]
    },
    {
      "tag": "greetings",
      "patterns": [
        "hello",
        "hey",
        "hey there",
        "yo",
        "ayee",
        "hi",
        "what's up?",
        "good morning",
        "good evening",
        "morning",
        "help",
        "hi there",
        "sup",
        "whats good",
        "good afternoon",
        "what's new?",
        "hows it going?",
        "how are you",
        "how are you doing?",
        "Long time no see",
        "Greetings",
        "Salutations",
        "top of the morning to you",
        "greetings, friend",
        "welcome",
        "howdy",
        "hey there partner",
        "what's crackin?",
        "peace",
        "good day",
        "cheers",
        "howdy-doo",
        "what's cookin?",
        "how's it hangin?",
        "what's the haps?",
        "what's the word?",
        "what's the good word?",
        "how's life?",
        "how's everything?",
        "how's business?",
        "how's the family?",
        "greetings and salutations"
      ],
      "responses": [
        "Hello!",
        "Hey!",
        "What can I do for you?",
        "How can I assist you?"
      ]
    },
    {
      "tag": "name",
      "patterns": [
        "What's your name?",
        "can you tell me your name?",
        "what do i call you?",
        "what are you?",
        "who are you?",
        "whats your name?",
        "May I know your name?",
        "Could you tell me your name, please?",
        "What shall I call you?",
        "What's the name?",
        "What do I address you as?",
        "Introduce yourself, please",
        "What's the handle?",
        "What's the moniker?",
        "Who do I have the pleasure of speaking with?",
        "Can you share your name with me?",
        "What's the label?",
        "What's the tag?",
        "What's the designation?",
        "What's the title?",
        "Can you give me your name?",
        "Can you tell me what to call you?",
        "What's the name on the tag?",
        "What's the handle on the tag?",
        "What's the moniker on the tag?",
        "What's the name on the label?",
        "What's the handle on the label?",
        "What's the moniker on the label?",
        "What's the name on the title?",
        "What's the handle on the title?",
        "What's the moniker on the title?",
        "What's the name on the designation?",
        "What's the handle on the designation?",
        "What's the moniker on the designation?",
        "What's the name on the tag?",
        "what are you?",
        "who are you?",
        "whats your name?",
        "What's the handle on the tag?",
        "What's the moniker on the tag?",
        "What's the name on the label?",
        "What's the handle on the label?",
        "What's the moniker on the label?",
        "What's the name on the title?",
        "What's the handle on the title?",
        "What's the moniker on the title?",
        "What's the name on the designation?",
        "What's the handle on the designation?",
        "What's the moniker on the designation?",
        "What should I call you?",
        "What's the name of the person I'm speaking with?",
        "What's your calling name?",
        "What's the name of the person in front of me?",
        "What name should I refer to you as?",
        "What's the name, I'll call you?",
        "What should I address you?",
        "Your name, if you don't mind?",
        "What's the name of the person I'm talking to?",
        "What's your identification?",
        "What's the title I should use?",
        "What's the name I should know?",
        "What's the name I should refer to?",
        "What's the name I should call?",
        "What's the name I should use?",
        "What's the name I should address?",
        "What's the name I should call you?",
        "What's the name I should address you?",
        "What's the name I should know you by?",
        "What's the name I should refer to you?",
        "Can you let me know your name?",
        "Can you give me your name please?",
        "Can you tell me your name kindly?",
        "Can you give me the name I should call you?",
        "What do you identify as?",
        "Who do you identify as?",
        "What exactly are you?",
        "Can you tell me what you are?",
        "What are you exactly?",
        "What shall I refer to you as?",
        "What is the name I should know?",
        "what are you?",
        "who are you?",
        "whats your name?",
        "What do you go by?",
        "What name should I know you by?",
        "what are you? a robot?",
        "what are you, an AI?",
        "what are you, a bot?",
        "what are you, a chatbot?",
        "what are you, a chat bot?",
        "what is your name please?",
        "What is the name I should address you as?"
      ],
      "responses": [
        "My name is TARS.",
        "I'm TARS, an AI Weatherbot.",
        "My name is TARS, I am an AI Weatherbot.",
        "You can call me TARS, I am an AI Weatherbot."
      ]
    },
    {
      "tag": "currentDewPoint",
      "patterns": [
        "What is the dew point right now?",
        "What is the current dew point?",
        "Can you tell me the dew point?",
        "What is the dew point in my area?",
        "Can you give me the dew point information?",
        "Could you let me know the dew point?",
        "What is the dew point temperature?",
        "Can you provide the dew point data?",
        "What is the current dew point temperature?",
        "Can you give me an update on the dew point?",
        "Could you tell me the dew point for my location?",
        "Can you give me the dew point forecast?",
        "What is the dew point reading?",
        "Can you share the dew point information?",
        "Could you provide the current dew point?",
        "What is the dew point level?",
        "Can you give me the dew point statistics?",
        "Could you tell me the dew point conditions?",
        "What is the dew point trend?",
        "Can you provide the dew point measurement?",
        "What is the dew point humidity?",
        "Can you give me the dew point update?",
        "Could you tell me the dew point forecast?",
        "What is the dew point index?",
        "Can you give me the dew point data for my location?",
        "What is the dew point scale?",
        "Can you provide the dew point reading?",
        "What is the dew point in my city?",
        "Can you give me the dew point for my region?",
        "What is the dew point for my ZIP code?",
        "What's the dew point like currently?",
        "Can you tell me the dew point temperature at this moment?",
        "What's the dew point situation?",
        "Can you give me the dew point for my location now?",
        "Could you let me know the current dew point?",
        "What's the dew point like in my area?",
        "Can you provide me with the current dew point information?",
        "What's the dew point reading in my city?",
        "Can you give me an update on the dew point in my region?",
        "Could you tell me the dew point forecast for my location?",
        "What's the dew point humidity level?",
        "Can you share the dew point information for my area?",
        "Could you give me the current dew point for my ZIP code?",
        "What's the dew point trend in my region?",
        "Can you provide me with the dew point measurement?",
        "What's the dew point conditions in my city?",
        "Can you give me the dew point update for my area?",
        "Could you tell me the dew point index for my location?",
        "What's the dew point like in my town?",
        "Can you give me the dew point for my neighborhood?",
        "What's the dew point for my street?",
        "Can you give me the dew point prediction for the current time?",
        "What is the dew point temperature at this moment?"
      ],
      "responses": [
        "The dew point in this area is currently {} Kelvin, or {} degrees Fahrenheit.",
        "This area's current dew point is {} Kelvin, or {} degrees Fahrenheit.",
        "In this area, the current dew point is {} Kelvin, or {} degrees Fahrenheit.",
        "The dew point in this area is currently {} Kelvin, or {} degrees Fahrenheit."
      ]
    },
    {
      "tag": "currentUvi",
      "patterns": [
        "What's the current UVI?",
        "Can you tell me the current UV index?",
        "What's the UV index now?",
        "Can you give me the current UV radiation level?",
        "Could you let me know the current UVI?",
        "What's the UVI situation?",
        "Can you provide me with the current UVI information?",
        "What's the current UVI reading?",
        "Can you give me an update on the UVI?",
        "Could you tell me the current UVI forecast?",
        "What's the UVI level now?",
        "Can you share the UVI information for my location?",
        "Could you give me the current UVI for my city?",
        "What's the UVI trend?",
        "Can you provide me with the UVI measurement?",
        "What's the UVI conditions?",
        "Can you give me the UVI update?",
        "Could you tell me the UVI index?",
        "What's the UVI like in my area?",
        "Can you give me the UVI for my region?",
        "What's the UVI for my ZIP code?",
        "What's the current UVI index?",
        "Can you tell me the UVI level?",
        "What's the UV radiation like now?",
        "Can you give me the current UV index for my location?",
        "Could you let me know the UVI situation?",
        "What's the UVI reading now?",
        "Can you provide me with the current UVI forecast?",
        "What's the UV intensity now?",
        "Can you give me an update on the UV index?",
        "Could you tell me the UVI index for my city?",
        "What's the UVI level at present?",
        "Can you share the UVI information for my area?",
        "Could you give me the current UVI for my region?",
        "What's the UVI trend right now?",
        "Can you provide me with the UVI measurement at this moment?",
        "What's the UVI conditions currently?",
        "Can you give me the UVI update for my location?",
        "Could you tell me the UVI index for my neighborhood?",
        "What's the UVI like in my city?",
        "Can you give me the UVI for my street?",
        "What's the UVI for my current location?",
        "Can you tell me the UV index for my city?",
        "What's the UV radiation level currently?",
        "Can you give me the current UVI for my area?",
        "Could you let me know the UVI situation for my location?",
        "What's the UVI reading like now?",
        "Can you provide me with the UVI forecast for the current time?",
        "What's the UV intensity like at the moment?",
        "Can you give me an update on the UVI for my location?",
        "Could you tell me the UVI index for the current time?",
        "What's the UVI level like right now?",
        "Can you share the UVI information for my region?",
        "Could you give me the current UVI for my neighborhood?",
        "What's the UVI trend like currently?",
        "Can you provide me with the UVI measurement for the present time?",
        "What's the current UV Index?",
        "Can you tell me the current UV Index level?",
        "What's the UV Index like now?",
        "Can you give me the current UV Index for my location?",
        "Could you let me know the UV Index situation?",
        "What's the UV Index reading now?",
        "Can you provide me with the current UV Index forecast?",
        "What's the UV Index like at present?",
        "Can you give me an update on the UV Index?",
        "Could you tell me the UV Index for my city?",
        "Yo, what's the current UV index?",
        "UV situation?",
        "What's the UV index like now?",
        "Can you give me an update on the UV?",
        "Could you let me know the UV index?",
        "What's the UV like at the moment?",
        "Can you give me the lowdown on the UV for my area?",
        "UV index right now, you know?",
        "What's the UV index forecast?",
        "Can you tell me the UV radiation level?"
      ],
      "responses": [
        "The UV index is currently {}.",
        "Currently, the UV index is {}.",
        "The UV index is {} right now.",
        "The current UV index is {}."
      ]
    },
    {
      "tag": "currentWind",
      "patterns": [
        "What's the current wind speed?",
        "Can you tell me the current wind speed?",
        "What's the wind speed like now?",
        "Can you give me the current wind speed for my location?",
        "Could you let me know the current wind speed?",
        "What's the wind speed situation?",
        "Can you provide me with the current wind speed information?",
        "What's the current wind speed reading?",
        "Can you give me an update on the wind speed?",
        "Could you tell me the current wind speed forecast?",
        "What's the wind speed level now?",
        "Can you share the wind speed information for my location?",
        "Could you give me the current wind speed for my city?",
        "What's the wind speed trend?",
        "Can you provide me with the wind speed measurement?",
        "What's the wind speed conditions?",
        "Can you give me the wind speed update?",
        "Could you tell me the wind speed index?",
        "What's the wind speed like in my area?",
        "Can you give me the wind speed for my region?",
        "What's the wind speed for my current location?",
        "Can you tell me the wind speed for my city?",
        "What's the wind like currently?",
        "Can you give me the current wind speed for my area?",
        "Could you let me know the wind speed situation for my location?",
        "What's the wind speed reading like now?",
        "Can you provide me with the wind speed forecast for the current time?",
        "What's the wind intensity now?",
        "Can you give me an update on the wind speed for my location?",
        "Could you tell me the wind speed for the current time?",
        "What's the wind speed level like right now?",
        "Can you share the wind speed information for my region?",
        "Could you give me the current wind speed for my neighborhood?",
        "What's the wind speed trend like currently?",
        "Can you provide me with the wind speed measurement for the present time?",
        "What's the wind velocity right now?",
        "Can you tell me the wind gust?",
        "What's the wind like currently?",
        "Can you give me the current wind direction and speed?",
        "Could you let me know the wind gusts?",
        "What's the wind speed forecast?",
        "Can you provide me with the current wind situation?",
        "What's the wind force?",
        "Can you give me an update on the wind?",
        "Could you tell me the wind direction?",
        "What's the wind speed and direction?",
        "Can you share the wind information for my location?",
        "Could you give me the current wind direction?",
        "What's the wind situation?",
        "Can you provide me with the wind measurement?",
        "What's the wind conditions?",
        "Can you give me the wind update?",
        "Could you tell me the wind forecast?",
        "What's the wind like in my area?",
        "Can you give me the wind for my region?",
        "What are the gusts like?",
        "It's windy",
        "How windy is it?",
        "Yo, what's the current wind speed?",
        "Wind speed right now, you know?",
        "Can you tell me what the wind doing?",
        "What's the wind like at the moment?",
        "Can you give me the lowdown on the wind for my area?",
        "Wind situation?",
        "What's the wind speed like now?",
        "Can you give me an update on the wind?",
        "Could you let me know the wind speed?",
        "What's the wind blowing at?",
        "What is the current wind direction?",
        "Can you tell me the wind direction right now?",
        "What direction is the wind blowing?",
        "Could you give me the wind direction?",
        "What's the wind direction currently?",
        "Can you tell me which way the wind is blowing?",
        "Could you give me an update on the wind direction?",
        "What's the current wind direction?",
        "Can you provide me with the wind direction?",
        "What way is the wind blowing right now?",
        "Could you tell me the wind direction at this moment?",
        "Can you give me the current wind direction?",
        "What's the wind direction like currently?",
        "Could you update me on the wind direction?",
        "Can you let me know the wind direction?",
        "What direction is the wind currently blowing?",
        "Could you provide me with the current wind direction?",
        "Can you tell me the wind direction right now?",
        "What's the current wind direction please?",
        "Could you give me the wind direction information?",
        "What is the wind direction currently facing?",
        "Can you tell me the wind's current direction?",
        "Could you provide me with the wind's current direction?",
        "What's the wind's direction now?",
        "Can you give me the present wind direction?",
        "What's the wind direction situation currently?",
        "Could you update me on the present wind direction?",
        "Can you let me know the wind's current direction?",
        "What's the current wind direction status?",
        "Where is the wind blowing?",
        "Where is the wind blowing right now?"
      ],
      "responses": [
        "The wind in this area is currently blowing at {} mph, from the {}.",
        "The current wind speed in this area is {} mph, from the {}.",
        "Right now, the wind speed in this area is {} mph, from the {}.",
        "As of now, the wind speed here is at {} mph, from the {}."
      ]
    },
    {
      "tag": "currentTemperature",
      "patterns": [
        "what is the temperature?",
        "is it hot outside?",
        "is it cold outside?",
        "what is the temperature like?",
        "what is the weather like?",
        "what's the temperature right now?",
        "can you tell me what the temperature is?",
        "tell me how hot it is outside",
        "tell me how cold it is outside",
        "tell me what the temperature is like right now",
        "what's the outdoor temperature?",
        "what's the temperature outside?",
        "how hot is it outside?",
        "how cold is it outside?",
        "how hot is it",
        "how cold is it",
        "whats the current temperature?",
        "is it warm outside?",
        "is it chilly outside?",
        "how warm is it outside?",
        "how chilly is it outside?",
        "can you give me an update on the temperature?",
        "update me on the temperature",
        "temperature check",
        "temperature update",
        "what's the temperature reading?",
        "can you tell me the current temperature outside?",
        "what is the temperature looking like right now?",
        "how does the temperature feel currently?",
        "can you give me the temperature at this specific time?",
        "hows the temperature right now?",
        "can you give me an estimate on the current temperature?",
        "whats the temperature in this place?",
        "whats the temperature for this place?",
        "wats the temp like currently?",
        "Can you tell me if it's sweater weather or not?",
        "What's the temperature like on a scale from 'polar vortex' to 'tropical paradise'?",
        "Can you give me the temperature in 'I need an extra blanket' or 'I need to break out the sunscreen' degrees?",
        "Can you tell me the temperature in 'I need a hot cocoa' or 'I need a cold beer' degrees?",
        "How hot/cold is it outside on a 'I need my parka' to 'I need my flip flops' scale?",
        "Can you give me the temperature in 'I need my AC' or 'I need my heater' degrees?",
        "What's the temperature like in 'I need my heavy coat' or 'I need my tank top' degrees?",
        "Can you tell me the temperature in 'I need my snow boots' or 'I need my sandals' degrees?",
        "How warm/cold is it outside on a 'I need my sweater' to 'I need my tank top' scale?",
        "Can you give me the temperature in 'I need my scarf' or 'I need my sunglasses' degrees?",
        "Can you tell me if it's 'frostbite' or 'sunburn' weather?",
        "How hot/cold is it outside on a 'I need my ski jacket' to 'I need my shorts' scale?",
        "Can you give me the temperature in 'I need my mittens' or 'I need my flip flops' degrees?",
        "Can you tell me the temperature in 'I need my hoodie' or 'I need my sunglasses' degrees?",
        "How warm/cold is it outside on a 'I need my sweater' to 'I need my sunhat' scale?",
        "Can you give me the temperature in 'I need my boots' or 'I need my sandals' degrees?",
        "Can you tell me if it's 'snowman' or 'beach' weather?",
        "How hot/cold is it outside on a 'I need my winter coat' to 'I need my swimsuit' scale?",
        "Can you give me the temperature in 'I need my wool socks' or 'I need my flip flops' degrees?",
        "Can you tell me the current temperature?",
        "Can you give me the current temperature?",
        "Can you tell me what the temperature is right now?",
        "What's the temperature at the moment?",
        "Can you give me an update on the current temperature?",
        "What's the temperature like currently?",
        "Can you tell me the temperature right now?",
        "Can you give me the current temperature reading?",
        "Can you tell me the temperature update?",
        "What's the current temperature situation?",
        "Can you give me the temperature forecast for the current time?",
        "Can you tell me the current outdoor temperature?",
        "What's the temperature currently?",
        "Can you give me the temperature in my location right now?",
        "What's the temperature like at the moment in my area?",
        "What's the temperature like now?",
        "Can you tell me the temperature now?",
        "What's the current temperature forecast?",
        "Can you give me the temperature reading right now?",
        "Can you tell me the temperature right at this moment?",
        "What's the temperature like currently in my region?",
        "Can you give me the current temperature for this zip code?",
        "What's the temperature like right now in my location?",
        "Can you tell me the temperature at the current time?",
        "What's the current temperature looking like?",
        "Can you give me the current temperature for this place?",
        "Is it hot or cold outside currently?",
        "Is it warm or cold outside?",
        "Is it hot or cold outside?",
        "Is it warm or cold?",
        "Is it hot or cold?",
        "Is it warm or cold outside right now?",
        "Is it hot or cold outside right now?",
        "Is it warm or cold right now?",
        "What's the current temperature situation?",
        "How does it feel outside?",
        "give me a temp reading",
        "whats the temperature of the surrounding area?",
        "whats this location's temperature",
        "whats the temperature of this location?",
        "whats the temperature of this place?",
        "whats the temperature of this area?",
        "whats the temperature of this city?",
        "whats the temperature of this town?",
        "how chilly is it?",
        "how warm is it?",
        "give me a temperature reading",
        "give me a temperature update",
        "tell me the temperature",
        "give me the temperature",
        "tell me the temperature update",
        "give me the temperature update",
        "tell me the temperature reading",
        "give me the temperature reading",
        "tell me the temperature forecast",
        "give me the temperature forecast",
        "tell me the temperature situation",
        "give me the temperature situation",
        "tell me the temperature for this place",
        "give me the temperature for this place",
        "tell me the temperature for this location",
        "give me the temperature for this location",
        "tell me the temperature for this area",
        "give me the temperature for this area",
        "tell me the temperature for this city",
        "give me the temperature for this city",
        "tell me the temperature for this town",
        "give me the temperature for this town",
        "tell me the temperature for this zip code",
        "give me the temperature for this zip code",
        "tell me the temperature for this region",
        "give me the temperature for this region",
        "tell me the temperature for this state",
        "give me the temperature for this state",
        "tell me the temperature for this country",
        "give me the temperature for this country",
        "tell me the temperature for this continent",
        "give me the temperature for this continent",
        "tell me the temperature for this planet",
        "give me the temperature for this planet",
        "tell me the temperature for this world",
        "give me the temperature for this world",
        "tell me the temperature for this universe",
        "give me the temperature for this universe",
        "tell me the temperature for this galaxy",
        "give me the temperature for this galaxy",
        "tell me the temperature for this solar system",
        "give me the temperature for this solar system",
        "tell me the temperature for this constellation"
      ],
      "responses": [
        "It is {} degrees in this area.",
        "The current temperature in this area is {} degrees.",
        "This area is about {} degrees.",
        "Currently, it is {} degrees in this area.",
        "The temperature in this area is currently {} degrees.",
        "The temperature in this area is {} degrees."
      ]
    },
    {
      "tag": "options",
      "patterns": [
        "How you could help me?",
        "What help you provide?",
        "How you can be helpful?",
        "What support is offered",
        "What are you able to do?",
        "What are some things you can do?",
        "What are some things you can help me with?",
        "What are some things you can assist me with?",
        "What are some of your functionalities?",
        "What are some of your capabilities?",
        "Tell me some things that you can do",
        "Tell me what you can do",
        "What are some commands",
        "What are your capabilities?",
        "What functions do you perform?",
        "What services can you offer?",
        "What assistance can you provide?",
        "What can you do for me?",
        "What are your features?",
        "What can I ask you to do?",
        "What tasks can you perform?",
        "What can you assist me with?",
        "What can you help me with?",
        "What can I expect from you?",
        "What can you do?",
        "What are you capable of?",
        "What's in your arsenal?",
        "What's in your skill set?",
        "What's in your toolbox?",
        "What's in your wheelhouse?",
        "What's in your bag of tricks?",
        "What's in your quiver?",
        "What do you specialize in?",
        "What do you excel at?",
        "What are your strengths?",
        "What are your areas of expertise?",
        "What are your best capabilities?",
        "What are your most impressive features?",
        "What are your most valuable assets?",
        "What are your most noteworthy abilities?",
        "What are your most remarkable functions?",
        "What are your most exceptional talents?",
        "What are your most unique offerings?",
        "What are your most innovative features?",
        "What are your most advanced capabilities?",
        "What are your most cutting-edge features?",
        "What are your most state-of-the-art features?",
        "What are your most forward-thinking features?",
        "What are the capabilities of this AI?",
        "What can this AI accomplish?",
        "What tasks is this AI able to perform?",
        "What can I expect from this AI?",
        "What services does this AI offer?",
        "What assistance can I receive from this AI?",
        "What are the features of this AI?",
        "What can I ask this AI to do?",
        "What can this AI assist me with?",
        "What can this AI help me with?",
        "What abilities does this AI have?",
        "What functions can this AI perform?",
        "What can this AI do for me?",
        "What are the strengths of this AI?",
        "What are the areas of expertise for this AI?",
        "What are the best capabilities of this AI?",
        "What are the most impressive features of this AI?",
        "What are the most valuable assets of this AI?",
        "What are the most noteworthy abilities of this AI?",
        "What are the most remarkable functions of this AI?",
        "What are the most exceptional talents of this AI?",
        "What are the most unique offerings of this AI?",
        "What are the most innovative features of this AI?",
        "What are the most advanced capabilities of this AI?",
        "What are the most cutting-edge features of this AI?",
        "What are the most state-of-the-art features of this AI?",
        "What are the most forward-thinking features of this AI?",
        "What specialities does this AI have?",
        "What does this AI excel at?",
        "What is in the skill set of this AI?",
        "What is in the toolbox of this AI?",
        "What is in the wheelhouse of this AI?",
        "What is in the bag of tricks of this AI?",
        "What is in the quiver of this AI?",
        "What can this AI do?",
        "What can this AI do for me?",
        "What can you perform?",
        "What tasks can you perform?",
        "What functions can you do?",
        "Tell me what you're capable of",
        "Tell me what you can perform"
      ],
      "responses": [
        "I'm an intelligent AI that's been trained to perform meteorological analysis. My current capabilities are : \n 1. I can tell you the current dew point. \n 2. I can tell you the current UV Index. \n 3. I can tell you the current wind speed and direction. \n 4. I can tell you the current temperature. \n 5. I can tell you the today's highest and coldest temperatures. \n 6. I can tell you how much it rained today. \n 7. I can tell you what time the sun will set today."
      ]
    },
    {
      "tag": "dailyHighTemp",
      "patterns": [
        "What is the highest temperature today?",
        "What was the maximum temperature for today?",
        "What is the top temperature for today?",
        "What was the peak temperature for today?",
        "What is the record temperature for today?",
        "What was the highest temperature recorded today?",
        "What is the maximum temperature recorded today?",
        "What was the top temperature recorded today?",
        "What is the peak temperature recorded today?",
        "What was the record temperature recorded today?",
        "What is the highest temperature forecast for today?",
        "What was the maximum temperature forecast for today?",
        "What is the top temperature forecast for today?",
        "What was the peak temperature forecast for today?",
        "What is the record temperature forecast for today?",
        "What was the hottest temperature for today?",
        "What is the warmest temperature for today?",
        "What was the highest temperature expected for today?",
        "What is the maximum temperature expected for today?",
        "What was the top temperature expected for today?",
        "What is the peak temperature expected for today?",
        "What was the record temperature expected for today?",
        "What is the highest temperature predicted for today?",
        "What was the maximum temperature predicted for today?",
        "What is the top temperature predicted for today?",
        "What was the peak temperature predicted for today?",
        "What is the record temperature predicted for today?",
        "What was the highest temperature reported for today?",
        "What is the maximum temperature reported for today?",
        "What was the top temperature reported for today?",
        "What is the peak temperature reported for today?",
        "What was the record temperature reported for today?",
        "What is the highest temperature forecasted for today?",
        "What was the maximum temperature forecasted for today?",
        "What is the top temperature forecasted for today?",
        "What was the peak temperature forecasted for today?",
        "What is the record temperature forecasted for today?",
        "What was the highest temperature of the day?",
        "What is the maximum temperature of the day?",
        "What was the top temperature of the day?",
        "What is the peak temperature of the day?",
        "What was the record temperature of the day?",
        "What is the highest temperature registered for today?",
        "What was the maximum temperature reached today?",
        "What is the highest temperature observed today?",
        "What was the maximum temperature recorded for today?",
        "What is the highest temperature today's forecast?",
        "What was the highest temperature of the day so far?",
        "What is the highest temperature of the current day?",
        "What was the most elevated temperature for today?",
        "What is the highest temperature reading for today?",
        "What was the maximum temperature measurement for today?",
        "Could you tell me the highest temperature for today?",
        "Can you give me the peak temperature for today?",
        "What is the record high temperature for today?",
        "Could you inform me of the highest temperature for today?",
        "Please share the highest temperature for the current day?",
        "What's the highest temperature reached today?",
        "What's the maximum temperature for today?",
        "Can you provide the highest temperature for today?",
        "The highest temperature for today, what is it?",
        "Could you provide me with the highest temperature for today?",
        "What's the peak temperature recorded for today?",
        "I would like to know the highest temperature for today?",
        "What is the highest temperature of the day?",
        "Can you give me the highest temperature of the day?",
        "What's the highest temperature we've seen today?",
        "Could you tell me what the highest temperature is today?",
        "What's the highest temperature we've had today?",
        "Can you give me the highest temperature recorded today?",
        "Could you tell me the maximum temperature for today?",
        "What's the highest temperature today?",
        "How hot did it get today?",
        "How hot was it today?",
        "How warm did it get today?",
        "How warm was it today?",
        "What about today's high?",
        "What about the highest temperature today?",
        "What about today's highest?",
        "What is todays highest?",
        "What is todays highest temperature?",
        "What was todays high?"
      ],
      "responses": [
        "Today, it got as hot as {} degrees.",
        "The highest temperature today was {} degrees.",
        "The maximum temperature today was {} degrees.",
        "It got up to {} degrees today.",
        "Today's highest temperature was {} degrees.",
        "Today's maximum temperature was {} degrees.",
        "Today's high was {} degrees.",
        "Today's highest reading was {} degrees.",
        "The temperature peaked at {} degrees today.",
        "The hottest it got today was {} degrees.",
        "According to my records, Today's warmest temperature was {} degrees."
      ]
    },
    {
      "tag": "dailyLowTemp",
      "patterns": [
        "What was the lowest temperature of the current day?",
        "What is the minimum temperature of today?",
        "Can you tell me the lowest temperature of today?",
        "What was the minimum temperature for today?",
        "Can you give me the lowest temperature for today?",
        "What is the minimum temperature reached today?",
        "Could you inform me of the lowest temperature for today?",
        "Please share the lowest temperature for the current day?",
        "What is the lowest temperature reading for today?",
        "What was the minimum temperature measurement for today?",
        "What is the lowest temperature forecast for today?",
        "Could you tell me the lowest temperature for today?",
        "What is the minimum temperature recorded for today?",
        "Can you provide the lowest temperature for today?",
        "What is the least temperature for today?",
        "What was the minimum temperature of the day so far?",
        "Can you give me the lowest temperature of the day?",
        "What's the lowest temperature we've seen today?",
        "What's the minimum temperature for today?",
        "What's the least temperature recorded for today?",
        "Could you tell me what the lowest temperature is today?",
        "What's the lowest temperature we've had today?",
        "Can you give me the lowest temperature recorded today?",
        "Could you tell me the minimum temperature for today?",
        "What's the lowest temperature today?",
        "What is the minimum temperature registered for today?",
        "What was the minimum temperature reached today?",
        "What is the lowest temperature observed today?",
        "What was the minimum temperature recorded for today?",
        "What is the lowest temperature today's forecast?",
        "What's the minimum temperature for the current day?",
        "What is the least temperature of the current day?",
        "Could you provide me with the lowest temperature for today?",
        "What's the minimum temperature reading for today?",
        "What's the minimum temperature measurement for today?",
        "What's the least temperature forecast for today?",
        "What's the minimum temperature of the day so far?",
        "What was the coldest it got today?",
        "What was the lowest temperature registered today?",
        "Can you give me the minimum temperature for the current day?",
        "What was the least temperature of the day?",
        "Could you inform me of the minimum temperature today?",
        "Please share the lowest temperature today?",
        "What is the lowest temperature reading today?",
        "What is the minimum temperature measurement for the current day?",
        "What is the lowest temperature forecast for the current day?",
        "Could you tell me the minimum temperature for the current day?",
        "What is the minimum temperature recorded for the current day?",
        "Can you provide the lowest temperature for the current day?",
        "What is the least temperature for the current day?",
        "What was the minimum temperature of the day?",
        "Can you give me the lowest temperature of the current day?",
        "What's the lowest temperature today?",
        "What's the minimum temperature for the current day?",
        "What's the least temperature recorded for the current day?",
        "Could you tell me the lowest temperature for the current day?",
        "What's the minimum temperature of the day so far?",
        "Can you give me the lowest temperature recorded for the current day?",
        "Tell me how chilly it got today",
        "How cold did it get today?",
        "Tell me how cold it got today",
        "How chilly did it get today?",
        "How cold was it today?",
        "How chilly was it today?",
        "Could you tell me the lowest temperature reached today?",
        "What was the coldest it got in the current day?",
        "What was the minimum temperature for today?",
        "Can you provide the minimum temperature for the current day?",
        "Could you give me the least temperature of the day?",
        "What was the minimum temperature recorded today?",
        "Can you inform me of the lowest temperature today?",
        "Can you give me the minimum temperature reading for today?",
        "Could you share the minimum temperature for the current day?",
        "What is the least temperature forecast for today?",
        "Can you tell me the lowest temperature of the current day?",
        "What's the minimum temperature measured today?",
        "What's the least temperature for today?",
        "Can you give me the minimum temperature of the current day?",
        "What was the minimum temperature during the current day?",
        "What about today's low?",
        "What about today's coldest?",
        "What was today's coldest temperature?",
        "What was todays coldest?",
        "What was todays lowest temperature?",
        "What was todays low?"
      ],
      "responses": [
        "Today, it got as cold as {} degrees.",
        "The lowest temperature today was {} degrees.",
        "The lowest temperature today was {} degrees.",
        "It got down to {} degrees today.",
        "Today's lowest temperature was {} degrees.",
        "Today's minimum temperature was {} degrees.",
        "Today's low was {} degrees."
      ]
    },
    {
      "tag": "dailyRain",
      "patterns": [
        "Could you tell me how much it rained today?",
        "What was the total rainfall for the current day?",
        "Can you provide the amount of rain for today?",
        "Could you give me the total rainfall for the current day?",
        "What was the rainfall recorded today?",
        "Can you inform me of the total rain for today?",
        "Can you give me the rain reading for today?",
        "Could you share the total rainfall for the current day?",
        "What is the forecast for rain for today?",
        "Can you tell me how much rain fell today?",
        "What's the total rainfall measured today?",
        "What's the total precipitation for today?",
        "Can you give me the total rain for the current day?",
        "What was the total rain during the current day?",
        "How much rain fell today?",
        "Can you tell me the total rain for the current day?",
        "What was the amount of rain for the current day?",
        "Could you provide the total rain for today?",
        "Can you give me the total rainfall for today?",
        "What was the total precipitation for the current day?",
        "Can you inform me of the rain for today?",
        "Can you give me the rain data for today?",
        "Could you share the rainfall for the current day?",
        "What is the rain forecast for today?",
        "Can you tell me the total rain that fell today?",
        "What's the amount of rain measured today?",
        "What's the total rain for today?",
        "Can you give me the rain for the current day?",
        "What was the total rain fall during the current day?",
        "How much precipitation did we get today?",
        "Can you tell me the total rainfall for the current day?",
        "What was the amount of precipitation for the current day?",
        "Could you provide the total precipitation for today?",
        "Can you give me the total rain fall for today?",
        "What was the total precipitation recorded today?",
        "Can you inform me of the total rainfall for today?",
        "Can you give me the precipitation reading for today?",
        "Could you share the total precipitation for the current day?",
        "What was the precipitation amount today?",
        "How much rain/snow fell today?",
        "What was the rainfall/snowfall amount today?",
        "Did it rain/snow today and if so, how much?",
        "What was the total precipitation for the current day?",
        "How much water did we get from the sky today?",
        "What was the liquid equivalent of precipitation for today?",
        "How much did the rain gauge/snow gauge measure today?",
        "What was the depth of precipitation today?",
        "What was the accumulation of precipitation today?",
        "What was the water volume from precipitation today?",
        "How much moisture did we receive today?",
        "What was the daily total for precipitation?",
        "What was the precipitation level for the current day?",
        "What was the precipitation measurement for today?",
        "What was the precipitation accumulation for the current day?",
        "How much did we get in terms of precipitation today?",
        "What was the precipitation rate for today?",
        "How much did it rain/snow today?",
        "What was the amount of precipitation for the current day?",
        "What was the precipitation total for today?",
        "Did we have any precipitation today and if so, how much?",
        "What was the precipitation figure for the current day?",
        "How much precipitation did we have today?",
        "What was the daily precipitation amount?",
        "How much did it rain/snow today, specifically?",
        "What was the precipitation count for today?",
        "What was the precipitation measurement for the current day?",
        "What was the daily precipitation rate?",
        "What was the precipitation quantity for today?",
        "What was the precipitation amount for the present day?",
        "How much rain did we get today?",
        "How much did it rain today",
        "What was the rain like today?",
        "How wet was it today?",
        "How wet did it get today?"
      ],
      "responses": [[
        "Today, {} inches of rain fell.",
        "There was {} inches of rain today.",
        "{} inches of rain fell today.",
        "Today's precipitation is about {} inches.",
        "Today's rainfall is about {} inches.",
        "Today's precipitation is about {} inches.",
        "Today's rain is about {} inches."
      ],
      [
        "According to my records, no rain fell today.",
        "I don't have any records of rain today.",
        "It did not seem to have rained today.",
        "It does not appear to have rained today.",
        "I don't remember it raining today.",
        "According to today's forecast, it has not rained today."
      ]
    ]
    },
    {
      "tag": "nextRain24hr",
      "patterns": [
        "Will it rain within the next 24 hours?",
        "Is there any rain in the forecast for the next 24 hours?",
        "When can I expect rain in the next 24 hours?",
        "Do you think it will rain within the next 24 hours?",
        "What are the chances of rain within the next 24 hours?",
        "Can you tell me if it will rain in the next 24 hours?",
        "Is it likely to rain within the next 24 hours?",
        "Should I expect rain in the next 24 hours?",
        "When will it start raining in the next 24 hours?",
        "What's the rain forecast for the next 24 hours?",
        "Will it rain at all in the next 24 hours?",
        "Do you know when it will rain in the next 24 hours?",
        "Can you give me the rain forecast for the next 24 hours?",
        "What's the probability of rain in the next 24 hours?",
        "When is the next rain expected within the next 24 hours?",
        "Do you have information on any rain in the next 24 hours?",
        "What's the chance of precipitation in the next 24 hours?",
        "Will there be any precipitation in the next 24 hours?",
        "When is it expected to rain in the next 24 hours?",
        "Can you tell me when it's going to rain in the next 24 hours?",
        "Is there a chance of rain in the next 24 hours?",
        "What is the rain outlook for the next 24 hours?",
        "Is there rain expected in the next 24 hours?",
        "Can you tell me the forecast for rain in the next 24 hours?",
        "What's the weather forecast for the next 24 hours in terms of rain?",
        "What's the precipitation forecast for the next 24 hours?",
        "When is the next rain expected in the next 24 hours?",
        "Do you have any information on rain in the next 24 hours?",
        "What is the chance of rain in the next 24 hours?",
        "Is rain expected in the next 24 hours?",
        "What's the rain outlook for the next 24 hours?",
        "Will it rain anytime in the next 24 hours?",
        "Can you give me a prediction on rain within the next 24 hours?",
        "When is the next rain forecasted in the next 24 hours?",
        "Is there a high chance of rain within the next 24 hours?",
        "What's the likelihood of rain in the next 24 hours?",
        "Is it probable that it will rain in the next 24 hours?",
        "What's the expected precipitation in the next 24 hours?",
        "Can you give me a forecast for rain in the next 24 hours?",
        "What's the chance that it will rain in the next 24 hours?",
        "What are the rain chances for the next 24 hours?",
        "Will there be any rain at all in the next 24 hours?",
        "When is the next precipitation expected in the next 24 hours?",
        "Is there going to be any rain in the next 24 hours?",
        "What's the expected rain forecast for the next 24 hours?",
        "Do you think there will be any rain in the next 24 hours?",
        "When is the next chance of rain within the next 24 hours?",
        "What's the chance that it will rain at all in the next 24 hours?",
        "Can you tell me when it's going to rain next?",
        "Is there rain in the next daily the forecast?",
        "When should I expect the rain to start?",
        "Will it be raining anytime soon?",
        "When is the next rainstorm coming?",
        "What's the likelihood of rain in the near future?",
        "Can you predict when it's going to rain?",
        "When will the next rainfall occur?",
        "What's the rain outlook for today and tomorrow?",
        "Can you give me an estimate of when it will start raining?",
        "When is the next rainy period expected?",
        "Are there any chances of rain in the coming hours?",
        "What's the chance of rain today?",
        "Can you tell me when the rain will start falling?",
        "When should I expect the rain to arrive?",
        "What's the expected time for the rain to start?",
        "Is it going to rain soon?",
        "When is the next chance of precipitation?",
        "Is there rain expected within the next day?",
        "Will it rain within the next day?",
        "Is there expected rain within the next day?",
        "What's the rain situation looking like?",
        "Can you give me an idea of when it's going to start raining?"
      ],
      "responses": [["Today, It is expected to rain at {}."], 
      ["\nHere is a rain forecast for the next 7 days:\n"],
      ["There is no rain expected within the next 7 days.", "According to my records, there is no expected precipitation in the next 7 days.", "I looked into the forecast for the next 7 days, and there doesn't seem to be any expected rain.", "According to my weekly forecast, there is no rain expected.", "There is no expected precipitation for the next 7 days.", "I do not see any expected preciptation forecast for the next 7 days."]
    ]
    },
    {
      "tag": "dailySunset",
      "patterns": [
        "When will the sun set today?",
        "What time will the sun go down today?",
        "What time is sunset for the current day?",
        "When does the sun set today?",
        "What is the sunset time for today?",
        "Can you tell me when the sun will set today?",
        "What is the scheduled time for sunset today?",
        "What is the approximate time for sunset today?",
        "Can you give me the time for when the sun will set today?",
        "What time can I expect the sun to set today?",
        "What is the sun's scheduled time of setting today?",
        "What time will the sun bid us farewell for the day?",
        "When can I catch the sunset today?",
        "What time will the day officially be over (in terms of sunlight)?",
        "What is the exact time of sunset for today?",
        "Can you provide me with the sunset time for the current day?",
        "What is the predicted time of sunset for today?",
        "What time does the sun set according to today's schedule?",
        "When does the day officially end (in terms of sunlight)?",
        "What is the estimated time for sunset today?",
        "Can you give me an idea of when the sun will set today?",
        "At what time can we say goodbye to the sun for the day?",
        "What time will the sun dip below the horizon today?",
        "What is today's scheduled sunset time?",
        "When can we expect the sun to set today?",
        "What is the calculated time of sunset for today?",
        "What time will the sun set according to current calculations?",
        "What is the planned time of sunset for the current day?",
        "When should we expect the sun to set today?",
        "What is the set time of sunset for the present day?",
        "What is the designated time of sunset for today?",
        "What time will the sun bid us adieu for the day?",
        "When will the daylight officially be over for today?",
        "What time will the sun say goodbye for the day?",
        "When will the sun take its leave for today?",
        "What is the intended time of sunset for today?",
        "What time will the sun depart for the day?",
        "When will the sun end its daily visit today?",
        "What time will the sun complete its daily journey today?",
        "What time will the sun complete its daily trek today?",
        "What time will the sun complete its daily voyage today?",
        "When will the sun bid us farewell?",
        "When will the day come to an end?",
        "When will the sky turn orange?",
        "When will the horizon turn red?",
        "When will the light fade?",
        "When will the day close?",
        "When will the sun say goodbye?",
        "When will the sun disappear?",
        "When will the stars come out?",
        "When will the moon take over?",
        "When will the day's end arrive?",
        "When will the sun take its leave?",
        "When will the light be extinguished?",
        "When will the day's curtain close?",
        "When will the sky turn dark?",
        "When will the sun's performance end?",
        "When will the day's show be over?",
        "When will the sun's final act begin?",
        "When will the day's encore end?",
        "When will the sun's reign end?",
        "When will the light be put out?",
        "When will the day be over?",
        "When will the sun take its final bow?",
        "When will the day's curtain fall?",
        "When will the sun's shift end?",
        "When will the day's work be done?",
        "When will the sun clock out?",
        "When will the day end?",
        "When will the sun retire?",
        "When will the day shift end?",
        "When will the sun's duty be done?",
        "When will the day's tenure end?",
        "When will the sun's watch be over?",
        "When will the day's tenure end?",
        "What is today's sunset time?"
      ],
      "responses": [
        "The sun will set today at {}pm.",
        "Today's sunset is at {}pm.",
        "The time of today's sunset is at {}pm.",
        "Today, the sunset time is {}pm.",
        "The sun will set today at about {}pm."
      ]
    },
    {
      "tag": "dailySunrise",
      "patterns": [
        "What time is the sunrise tomorrow?",
        "When does the sun come up tomorrow?",
        "When is the next sunrise?",
        "What time will the sun rise tomorrow?",
        "When will the sun rise tomorrow?",
        "What time will the sunrise be?",
        "When will the sunrise occur tomorrow?",
        "What time can I expect the sunrise tomorrow?",
        "When can I expect the sun to rise tomorrow?",
        "What time does the sun come up?",
        "When does the sunrise happen tomorrow?",
        "At what time will the sun rise tomorrow?",
        "When will the next sunrise occur?",
        "What is the sunrise time tomorrow?",
        "When will the sun be up tomorrow?",
        "What time does the sun rise tomorrow?",
        "When is the sun going to rise tomorrow?",
        "What time is the next sunrise?",
        "When can I see the sunrise tomorrow?",
        "When is the sun going to come up tomorrow?",
        "What time will the sun come up?",
        "When does the sun rise?",
        "What time does the sunrise happen?",
        "When will the sun rise?",
        "What time can I see the sunrise?",
        "When is the next time the sun will rise?",
        "What is the time of the sunrise?",
        "When is the next sunrise happening?",
        "What time will the sun be visible?",
        "When can I watch the sunrise tomorrow?",
        "What time is sunrise?",
        "When will the sun be rising tomorrow?",
        "What time is the sunrise?",
        "When is sunrise tomorrow?",
        "What time will the sun be rising?",
        "When can I see the beautiful sunrise tomorrow?",
        "What time will the sun be coming up?",
        "When does the sun come up?",
        "What time is the sun going to come up?",
        "When is the next sun rising?",
        "What time can I watch the sunrise?",
        "When will the sunrise be tomorrow?",
        "What time is the sun going to rise?",
        "When is the next time I can see the sunrise?",
        "What time will the sun come out?",
        "When can I see the sun rise tomorrow?",
        "What time does the sun appear?",
        "When does the sun show up?",
        "What time will the sun show up?",
        "When is the next sunrise going to be?",
        "What time can I expect to see the sunrise?",
        "When is the sun rising?",
        "What time is the sun rising?",
        "When will I see the sunrise?",
        "What time will the sunrise start?",
        "When is the next time the sun will be up?",
        "What time is the sun appearing?",
        "When does the sun appear?",
        "What time is the sunrise in the morning?",
        "When will the sun be visible tomorrow?",
        "What time can I see the sun rising?",
        "When is the next sunrise coming?",
        "What time is the next sunrise tomorrow?",
        "When will the sun be up?",
        "What time is the sun up?",
        "When will the sun come up in the morning?",
        "What time will the sun rise in the morning?",
        "When is the next time I can see the sun rise?",
        "What time can I see the sunrise in the morning?",
        "When will the sun be up in the sky?",
        "What time will the sun be up in the morning?",
        "When is the next time I can watch the sunrise?",
        "What time is the sun visible?",
        "When can I see the sunrise in the sky?",
        "When will the sun appear tomorrow?",
        "What time will the sun be out?",
        "When is the next time the sun will appear?",
        "What time is the dawn tomorrow?",
        "When is the sun going to be up?",
        "What time is the sunrise scheduled for?",
        "When can I see the sunrise in my location?",
        "What time is the sunrise at my location?",
        "When will the sunrise happen in my location?",
        "What time will the sun come up in my location?",
        "When can I watch the sunrise at my location?",
        "What time does the sun rise in my area?",
        "When will the sun rise in my area?",
        "What time will the sunrise be in my area?",
        "When can I see the sunrise in my area?",
        "What time is the sunrise at this location?",
        "When will the sunrise happen at this location?",
        "What time will the sun rise at this location?",
        "When can I see the sunrise at this location?",
        "What time is the sunrise today?",
        "When will the sun rise today?",
        "What time is the next sunrise today?",
        "When will the sun be up today?",
        "What time does the sun come up today?",
        "What time is the sunrise in my region?",
        "When will the sunrise happen in my region?",
        "What time will the sun come up in my region?",
        "When can I watch the sunrise in my region?",
        "What time does the sun rise in my region?",
        "When will the sun rise in my region?",
        "What time will the sunrise be in my region?",
        "When can I see the sunrise in my region?"
      ],
      "responses": [
        "Today, the sun rose at {}am. Tommorrow, the sun will rise at {}am."
      ]
    },
    {
      "tag": "currentHumidity",
      "patterns": [
        "What's the current humidity?",
        "How humid is it right now?",
        "Can you tell me the humidity level?",
        "What's the humidity like?",
        "Is it humid outside?",
        "What's the current level of moisture in the air?",
        "How much moisture is in the air?",
        "Can you give me the current moisture level?",
        "What's the moisture level outside?",
        "How much moisture is there in the atmosphere?",
        "Can you tell me the current atmospheric moisture level?",
        "What's the current level of dampness?",
        "How damp is it currently?",
        "Can you give me the current level of wetness?",
        "What's the wetness level outside?",
        "How much moisture is there in the air right now?",
        "Can you tell me the level of dampness in the atmosphere?",
        "What's the dew point outside?",
        "How much moisture is there in the dew outside?",
        "What's the level of humidity in the air?",
        "How much humidity is there right now?",
        "Can you give me the current level of atmospheric humidity?",
        "What's the current level of moisture in the atmosphere?",
        "How much moisture is in the air outside?",
        "Can you tell me the current level of atmospheric moisture?",
        "What's the current moisture content?",
        "How much moisture is there right now?",
        "Can you give me the current moisture content?",
        "What's the current level of moisture in the air?",
        "How much moisture is in the air around me?",
        "Can you tell me the current moisture level around me?",
        "What's the current level of moisture in the environment?",
        "How much moisture is there in the environment right now?",
        "Can you give me the current environmental moisture level?",
        "What's the level of humidity inside?",
        "How much humidity is there indoors?",
        "Can you give me the current indoor humidity level?",
        "What's the current level of atmospheric moisture indoors?",
        "How much moisture is in the air indoors?",
        "Can you tell me the indoor moisture level?",
        "What's the current level of dampness indoors?",
        "How damp is it indoors?",
        "Can you give me the current level of indoor wetness?",
        "What's the indoor wetness level?",
        "How much moisture is there indoors?",
        "What's the current humidity level?",
        "What's the humidity like right now?",
        "How humid is it currently?",
        "Could you tell me the current level of humidity?",
        "What's the humidity at this moment?",
        "What's the current humidity percentage?",
        "How moist is it currently?",
        "What's the level of moisture in the air right now?",
        "What's the humidity reading now?",
        "What's the humidity measurement right now?",
        "What's the present humidity level?",
        "What's the humidity index right now?",
        "What's the level of atmospheric moisture right now?",
        "What's the present level of humidity?",
        "What's the humidity level currently?",
        "What's the humidity percentage at present?",
        "What's the moisture level at the moment?",
        "What's the current level of atmospheric moisture?",
        "What's the current level of water vapor in the atmosphere?",
        "What's the current level of air moisture?",
        "What's the current level of dampness in the environment?",
        "What's the current level of moisture in the environment?",
        "What's the current level of atmospheric dampness?",
        "What's the current level of humidity in the air around me?",
        "What's the current level of humidity in the surrounding atmosphere?",
        "What's the current level of moisture in the surrounding environment?",
        "What's the current level of water vapor in the surrounding air?",
        "What's the current level of dampness in the surrounding atmosphere?",
        "What's the current level of atmospheric moisture content in the surrounding environment?",
        "What's the current level of relative humidity in the surrounding atmosphere?",
        "What's the current level of moisture content in the surrounding environment?",
        "What's the current level of water in the surrounding air?",
        "What's the current level of moisture in the surrounding air?",
        "What's the current level of humidity in the environment around me?",
        "What's the current level of atmospheric moisture in the surrounding environment?",
        "What's the current level of water vapor in the environment around me?",
        "What's the current level of air moisture in the surrounding atmosphere?",
        "What's the current level of dampness in the environment around me?",
        "What's the current level of moisture in the surrounding atmosphere?",
        "What's the current level of atmospheric dampness in the environment around me?",
        "What's the current level of humidity in the air where I am?",
        "What's the current level of humidity in the atmosphere near me?",
        "What's the current level of moisture in the environment near me?",
        "What's the current level of water vapor in the air where I am?",
        "What's the current level of dampness in the atmosphere near me?",
        "What's the current level of atmospheric moisture content in the environment near me?",
        "What's the current level of relative humidity in the atmosphere near me?",
        "What's the current level of moisture content in the environment near me?"
      ],
      "responses": ["The current humidity in this area is {}%."]
    },
    {
      "tag": "currentPressure",
      "patterns": [
        "What's the current air pressure?",
        "Can you tell me the air pressure right now?",
        "I'm curious about the air pressure. What is it?",
        "What's the air pressure reading at the moment?",
        "Could you give me the current atmospheric pressure?",
        "What is the current atmospheric pressure measurement?",
        "Do you know what the air pressure is currently?",
        "What's the current barometric pressure?",
        "What's the current reading for the barometric pressure?",
        "Can you give me the barometric pressure reading?",
        "I'd like to know the current barometric pressure. What is it?",
        "What's the atmospheric pressure right now?",
        "Can you give me the current atmospheric pressure?",
        "I'm interested in knowing the current atmospheric pressure. What is it?",
        "What's the current pressure of the air?",
        "Can you give me the current air pressure?",
        "I'm curious about the air pressure. What is it right now?",
        "What's the pressure of the air at the moment?",
        "What's the current reading for the air pressure?",
        "What's the current reading for the atmospheric pressure?",
        "What's the current reading for the barometric pressure?",
        "Can you tell me what the current atmospheric pressure is?",
        "I'd like to know the current reading for the atmospheric pressure. What is it?",
        "What's the current pressure measurement for the air?",
        "Can you give me the current barometric pressure reading?",
        "I'm curious about the atmospheric pressure. What is it right now?",
        "What's the current pressure of the atmosphere?",
        "What's the atmospheric pressure reading at the moment?",
        "Can you give me the current reading for the atmospheric pressure?",
        "I'd like to know the current reading for the barometric pressure. What is it?",
        "What's the current measurement for the atmospheric pressure?",
        "What's the current atmospheric pressure value?",
        "What's the current reading for the air pressure?",
        "What's the current air pressure value?",
        "What's the current barometric pressure value?",
        "Can you tell me what the air pressure is right now?",
        "I'm interested in knowing the current air pressure. What is it?",
        "What's the air pressure reading at the moment?",
        "What's the current pressure of the environment?",
        "What's the current reading for the pressure of the air?",
        "Can you give me the current reading for the air pressure?",
        "I'd like to know the current barometric pressure value. What is it?",
        "What's the current reading for the pressure of the atmosphere?",
        "What's the current pressure measurement for the atmosphere?",
        "Can you tell me what the current barometric pressure is?",
        "I'm curious about the current atmospheric pressure value. What is it?",
        "What's the current measurement for the barometric pressure?",
        "What's the current atmospheric pressure level?",
        "What's the current reading for the pressure of the environment?",
        "What's the current measurement for the air pressure?",
        "Can you give me the current atmospheric pressure value?",
        "I'd like to know the current reading for the pressure of the environment. What is it?",
        "What's the current barometric pressure level?",
        "What's the atmospheric pressure like right now?",
        "Can you give me the current pressure reading for the atmosphere?",
        "I'd like to know the current air pressure measurement. What is it?",
        "What's the current barometric reading for pressure?",
        "What is the current reading for atmospheric pressure?",
        "Can you tell me what the current pressure is?",
        "What's the current air pressure level?",
        "I'm curious about the current barometric pressure. What is it?",
        "What's the current reading for air pressure?",
        "What's the current atmospheric pressure reading?",
        "Can you give me the current barometric pressure measurement?",
        "I'd like to know the current reading for pressure. What is it?",
        "What's the air pressure like right now?",
        "What is the current atmospheric pressure value?",
        "Can you tell me the current reading for barometric pressure?",
        "What's the current pressure level?",
        "What's the current air pressure value?",
        "I'm interested in knowing the current atmospheric pressure level. What is it?",
        "What's the current pressure value?",
        "Can you give me the current atmospheric pressure reading?",
        "What's the current barometric pressure measurement?",
        "I'd like to know what the current reading is for atmospheric pressure.",
        "What's the pressure like at the moment?",
        "What is the current barometric pressure value?",
        "Can you tell me what the current air pressure measurement is?",
        "What's the current reading for atmospheric pressure like?",
        "What's the current reading for the pressure of the atmosphere?",
        "I'm curious about the current air pressure value. What is it?",
        "What's the current reading for the pressure of the air like?",
        "What's the current barometric pressure level?",
        "Can you give me the current air pressure level?",
        "What's the current reading for the atmospheric pressure level?",
        "What's the current atmospheric pressure level like?",
        "I'd like to know the current measurement for the pressure of the atmosphere. What is it?",
        "What's the current air pressure like at the moment?",
        "What is the current barometric pressure reading?",
        "Can you tell me the current atmospheric pressure level?",
        "What's the current reading for the air pressure level?",
        "What's the current barometric pressure like?",
        "What's the current atmospheric pressure measurement?",
        "I'm interested in knowing the current pressure reading. What is it?",
        "What's the current atmospheric pressure level reading?",
        "What's the current reading for the pressure of the atmosphere like?",
        "Can you give me the current atmospheric pressure level reading?",
        "What's the current air pressure level like at the moment?",
        "What's the current reading for the atmospheric pressure value?",
        "What's the current barometric pressure value like?",
        "I'd like to know the current measurement for the air pressure. What is it?",
        "What's the current reading for the atmospheric pressure level like?",
        "What's the current pressure reading like?"
      ],
      "responses": [
        "The current air pressure is about {} hPa, or {} inHg (inches of mercury)."
      ]
    },
    {
      "tag": "currentVisibility",
      "patterns": [
        "What's the current visibility like?",
        "What is the current visibility reading?",
        "How far can you see right now?",
        "What's the current distance you can see?",
        "What's the current visibility in meters?",
        "What's the visibility like outside?",
        "What is the current visibility level?",
        "How clear is it outside?",
        "What is the current visibility condition?",
        "What's the current level of visibility?",
        "What is the current visibility range?",
        "How far can I see right now?",
        "What is the visibility range at the moment?",
        "What is the current level of atmospheric clarity?",
        "What is the current atmospheric transparency?",
        "How well can you see outside right now?",
        "What's the current state of visibility?",
        "What is the current atmospheric haze level?",
        "What's the current atmospheric visibility?",
        "What is the current atmospheric obscurity level?",
        "What is the current level of atmospheric clarity?",
        "What is the current state of atmospheric transparency?",
        "What is the current level of atmospheric haze?",
        "What's the current atmospheric obscurity?",
        "How good is the visibility outside right now?",
        "What's the current range of visibility?",
        "What is the current level of atmospheric fog?",
        "What is the current state of atmospheric clarity?",
        "What's the current atmospheric transparency level?",
        "How far can you see through the air right now?",
        "What's the current level of atmospheric obscurity?",
        "What is the current atmospheric visibility range?",
        "What's the current range of atmospheric visibility?",
        "What is the current atmospheric haze range?",
        "What is the current atmospheric clarity range?",
        "What's the current atmospheric obscurity range?",
        "What is the current atmospheric transparency range?",
        "How far is the visibility range right now?",
        "What is the current range of atmospheric clarity?",
        "What is the current range of atmospheric transparency?",
        "What is the current range of atmospheric obscurity?",
        "What's the current atmospheric visibility distance?",
        "What's the current atmospheric obscurity distance?",
        "What's the current atmospheric transparency distance?",
        "What's the current atmospheric haze distance?",
        "What's the current atmospheric clarity distance?",
        "How far can I see through the air right now?",
        "What is the current atmospheric visibility level?",
        "What is the current atmospheric obscurity level?",
        "What is the current atmospheric transparency level?",
        "What is the current atmospheric haze level?",
        "What is the current atmospheric clarity level?",
        "What's the distance you can see outside?",
        "What is the current atmospheric visibility distance?",
        "How many miles can you see right now?",
        "What's the current level of atmospheric clarity?",
        "What's the current atmospheric clarity rating?",
        "What's the current atmospheric obscurity rating?",
        "What is the current atmospheric haze rating?",
        "What's the current atmospheric transparency rating?",
        "How far can you see through the air?",
        "What's the current range of atmospheric haze?",
        "What's the current range of atmospheric obscurity?",
        "What's the current range of atmospheric transparency?",
        "What's the current range of atmospheric clarity?",
        "What is the current level of atmospheric mist?",
        "What is the current level of atmospheric smog?",
        "What is the current level of atmospheric smoke?",
        "What's the current atmospheric visibility condition?",
        "What is the current atmospheric fog level?",
        "What is the current atmospheric smog level?",
        "What is the current atmospheric smoke level?",
        "How clear is it outside right now?",
        "What's the current level of atmospheric pollution?",
        "What's the current atmospheric pollution rating?",
        "What's the current atmospheric visibility level in kilometers?",
        "What's the current atmospheric visibility level in miles?",
        "What's the current level of atmospheric visibility obstruction?",
        "What is the current atmospheric visibility distance in kilometers?",
        "What is the current atmospheric visibility distance in miles?",
        "How well can you see through the air?",
        "What's the current level of atmospheric haze?",
        "What's the current atmospheric visibility range in kilometers?",
        "What's the current atmospheric visibility range in miles?",
        "What's the current atmospheric clarity range in kilometers?",
        "What's the current atmospheric clarity range in miles?",
        "What's the current atmospheric obscurity range in kilometers?",
        "What's the current atmospheric obscurity range in miles?",
        "What's the current atmospheric transparency range in kilometers?",
        "What's the current atmospheric transparency range in miles?",
        "What's the current atmospheric haze range in kilometers?",
        "What's the current atmospheric haze range in miles?",
        "What's the current atmospheric pollution range in kilometers?",
        "What's the current atmospheric pollution range in miles?",
        "What is the current level of atmospheric smaze?",
        "What is the current level of atmospheric fume?",
        "What is the current level of atmospheric dust?",
        "What's the current level of atmospheric opacity?",
        "What's the current level of atmospheric turbidity?",
        "What's the current atmospheric visibility distance in meters?",
        "What's the current atmospheric visibility level in meters?",
        "What is the current level of atmospheric particulate matter?",
        "What's the current level of atmospheric air quality?"
      ],
      "responses": ["The current visibility in the surrounding area is approximately {} miles.", "The visibility in this area is currently {} miles.", "In this area, I can measure the visibility at about {} miles.", "In this area, you can currently see up to about {} miles."]
    }
  ]
}
